{
    "basic_info": {
      "description_header": "Why Hello There :D",
      "description": "I'm Obi, a Front-End Web Developer from Houston, Texas. When I'm not meddling with a sudoku puzzle or immersing myself in a novel, I enjoy sharpening my skills in frameworks like React, Angluar and Vue. I am a firm believer in the ideology \"You are always a student, never a master\", and as such, I embrace every opportunity to further my knowledge and learn something new. I am as enthralled by nature as I am technology, you can find me under a tree in my spare time. ",
      "section_name": {
        "about": "Get to know me",
        "projects": "crafting",
        "skills": "skill points",
        "experience": "Battle xp"
      }
    },
    "projects": [
      {
        "title": "Crwn-Clothing",
        "startDate": "current",
        "description": "This project has been one of the most complex applications that I have had the opportunity to work with. Firebase, Routing, Authentication, React, Redux, phew! I had to push myself to not only implememnt, but really understand everything I was dealing with here. I am currently building this website as a part of Andrei Neagoie of Zero to Mastery academy's brilliant course.",
        "images": [
          "images/portfolio/crwn-clothing/p1.jpg",
          "images/portfolio/crwn-clothing/p2.jpg"
        ],
        "url": "https://github.com/hitogiri/crwn-clothing-",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-redux-plain",
            "name": "Redux"
          },
          {
            "class": "devicon-sass-plain",
            "name": "Sass"
          }
        ]
      },
      {
        "title": "TinDog",
        "startDate": "2022",
        "description": "A website for all the dog lovers <3 ...literally! A very interesting dive into web design, coded as a tutorial for a course taught by Angela Yu",
        "images": [
          "images/portfolio/tindog/p1.jpg",
          "images/portfolio/tindog/p2.jpg"
        ],
        "url": "https://github.com/hitogiri/TinDog",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          }
        ]
      },
      {
        "title": "Simon Says",
        "startDate": "2021",
        "description": "A very fun little implementation of the classic Hasbro Simon Says game. Made with javascript, jQuery, and some CSS; I found this to be an interesting challenge put forth by Angela Yu from the London App Brewery",
        "images": [
          "images/portfolio/simon/p1.jpg",
          "images/portfolio/simon/p2.jpg"
        ],
        "url": "https://github.com/hitogiri/Simon-Game",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-jquery-plain",
            "name": "jQuery"
          }
        ]
      }
    ],
    "experience": [
      {
        "description": "Throughout my time as a web developer, I have learned to utilize my knowledge of the latest software and project application trends to better provide quality service while maintaining site applicability. I have planned website development and converted mock-ups into usable web pages using my knowledge of HTML, JavaScript, JSX, and CSS. I also routinely leverage the React JavaScript library to create dynamic websites and web applications.",
        "company": "Freelance",
        "title": "Front-End Web Developer",
        "years": "08/2019 - Present",
        "mainTech": [
          "React",
          "JavaScript",
          "Angular",
          "Redux"
        ],
        "technologies": [
          "React",
          "REST API",
          "HTML5",
          "JavaScript",
          "Bootstrap",
          "CSS3/SCSS",
          "jQuery"
        ]
      },
      {
        "description": "I like to think back on this period as when I \"cut my web-dev teeth\" so to speak. I Maintained full-time employment while educating myself on one of the most popular JavaScript libraries. At work I displayed superior oral communication skills and an ability to communicate effectively with both customers and colleagues. I was responsible for assisting the guests needs, and responding to their inquiries. My time in customer service fostered my ability to understand exigencies and address any and all concerns",
        "company": "Pho Tai",
        "title": "Self Taught React Student/ Shift Lead",
        "years": "10/2017 - 11/2019",
        "mainTech": [
          "React"
        ],
        "technologies": [
          "JavaScript",
          "HTML",
          "CSS",
          "Communication",
          "Teamwork",
          "Leadership",
          "Customer Service"
        ]
      }
    ]
  }
